Autodesk.Revit.DB.Events.RevitAPIPreEventArgs.Cancel
When the event is cancellable, may call the Cancel() method to cancel it.
Remarks:
Not every event is cancellable.
Whether or not an event may be cancelled is indicated by IsCancellable() method.
Since:
2011

Autodesk.Revit.DB.Events.RevitAPIPreEventArgs
The class is used as a base class for the arguments for any pre-event.
Remarks:
A pre-event is the event raised before executing the process that was related with the event.
Since:
2011